# Join Statements

## Introduction

In this lab, you'll practice your knowledge on Join statements.

## Objectives

You will be able to:
- Write queries that make use of various types of Joins
- Join tables using foreign keys

## CRM Schema

In almost all cases, rather then just working with a single table we will typically need data from multiple tables. 
Doing this requires the use of **joins ** using shared columns from the two tables. 

In this lab, we'll use the same Customer Relationship Management (CRM) database we used in our lecture before!
<img src='Database-Schema.png' width=550>

## Connecting to the Database
Import the necessary packages and connect to the database **data.sqlite**.

In [1]:
#Your code here
import sqlite3
import pandas as pd
conn = sqlite3.connect('data.sqlite', detect_types=sqlite3.PARSE_COLNAMES)
cur = conn.cursor()

## Display the names of all the employees in Boston.

In [8]:
#Your code heres
cur.execute("""SELECT lastName, firstName FROM employees
                        JOIN offices
                        USING(officeCode)
                        WHERE city = 'Boston';""")
cur.fetchall()

[('Firrelli', 'Julie'), ('Patterson', 'Steve')]

## Do any offices have no employees?

In [9]:
#Your code here
cur.execute("""SELECT city,
                    COUNT(*)
                    FROM offices
                    LEFT JOIN employees
                    USING(officeCode)
                    GROUP BY 1;""")
df = pd.DataFrame(cur.fetchall())
df.head()

               0  1
0         Boston  2
1         London  2
2            NYC  2
3          Paris  5
4  San Francisco  6

In [ ]:
#Nope!

## Write 3 Questions of your own and answer them

In [ ]:
#Who are the big spenders in a sinlge order

In [12]:
cur.execute('''SELECT contactLastName, contactFirstName, amount
            FROM customers
            LEFT JOIN payments
            USING(customerNumber)
            WHERE amount > 100;
            ''')
df = pd.DataFrame(cur.fetchall())
df.head()

         0        1         2
0  Schmitt  Carine   14571.44
1  Schmitt  Carine    1676.14
2  Schmitt  Carine    6066.78
3     King     Jean  14191.12
4     King     Jean  32641.98

In [14]:
# Count of orders that included a particular product
cur.execute("""SELECT productName,
                    COUNT(*)
                    FROM products
                    LEFT JOIN orderdetails
                    USING(productCode)
                    GROUP BY 1;""")
df = pd.DataFrame(cur.fetchall())
df.head()

                                     0   1
0  18th Century Vintage Horse Carriage  28
1                18th century schooner  27
2               1900s Vintage Bi-Plane  28
3              1900s Vintage Tri-Plane  28
4                    1903 Ford Model A  27

In [ ]:
#See not yet shipped orders count by customer
cur.execute("""SELECT contactLastName, contactFirstName,
                    COUNT(*)
                    FROM customers
                    LEFT JOIN orders
                    USING(customerNumber)
                    WHERE shippedDate ;""")
df = pd.DataFrame(cur.fetchall())
df.head()

## Level Up: Display the names of each product each employee has sold.

In [ ]:
# Your code here

## Level Up: Display the Number of Products each Employee Has sold

In [ ]:
#Your code here

## Summary

Congrats! You now know how to use Join statements, along with leveraging your foreign keys knowledge!